app/Http/Controllers/AdminController.php

select * from `users`
---
    public function usersIndex(){

        $users = User::all();