app/Http/Controllers/CalendarController.php

select * from `events` where `events`.`deleted_at` is null
---
    public function index(){
        $events = Event::all()
            ->map(function ($event) {
                if (! $event->trashed()) {
                return [
                    'title' => $event->title,
                    'start' => $event->date_start,
                    'end' => $event->date_finish,
                    'url' => "/events/{$event->id}",
                ];
                };
            });