app/Http/Controllers/EventController.php

insert into `event_user` (`created_at`, `event_id`, `updated_at`, `user_id`) values ('2020-04-09 22:36:29', 1, '2020-04-09 22:36:29', 2)
delete from `event_user` where `event_id` = 1 and `user_id` in (1)
---
    public function attend(Event $event)
    {
        $user = Auth::user();

        if (! $event->users->contains($user)) {
            $event->users()->attach($user);
            toastr()->success("You're now attending this event!");
        } else {
            $event->users()->detach($user);

insert into `events` (`title`, `description`, `date_start`, `date_finish`, `updated_at`, `created_at`) values ('delete me', 'delete me', '2020-04-10', '2020-04-10', '2020-04-10 15:42:35', '2020-04-10 15:42:35')
---
    public function create(Request $request, Event $event){

        $newEvent = new Event;

        $newEvent->title = $request->name;
        $newEvent->description = $request->description;
        $newEvent->date_start = $request->startDate;
        $newEvent->date_finish = $request->finishDate;

        $newEvent->save();

select * from `events`
select * from `events` where `events`.`deleted_at` is null
---
    public function table(){

        if (request()->has('deleted')) {
            $events = Event::withTrashed()->get();
        } else {
            $events = Event::all();