app/Http/Controllers/WelcomeController.php

select * from `users`
---
    public function index(){

        $files = Storage::allFiles('/public/img/site-header');

        $userCount = count(User::all());